betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_gpio_ex.h
/**
  * @brief Enable the remapping of ADC2_ETRGREG (ADC 2 External trigger injected conversion).
  * @note  ENABLE: ADC2 External Event injected conversion is connected to TMR8 Channel4.
  * @retval None
  */
#define __DAL_AFIO_REMAP_ADC2_ETRGINJ_ENABLE()  AFIO_REMAP_ENABLE(AFIO_REMAP1_ADC2_ETRGINJC_RMP)

/**
  * @brief Disable the remapping of ADC2_ETRGREG (ADC 2 External trigger injected conversion).
  * @note  DISABLE: ADC2 External trigger injected conversion is connected to EINT15
  * @retval None
  */
#define __DAL_AFIO_REMAP_ADC2_ETRGINJ_DISABLE() AFIO_REMAP_DISABLE(AFIO_REMAP1_ADC2_ETRGINJC_RMP)

/**
  * @brief Enable the remapping of ADC2_ETRGREG (ADC 2 External trigger regular conversion).
  * @note  ENABLE: ADC2 External Event regular conversion is connected to TMR8 TRG0.
  * @retval None
  */
#define __DAL_AFIO_REMAP_ADC2_ETRGREG_ENABLE()  AFIO_REMAP_ENABLE(AFIO_REMAP1_ADC2_ETRGREGC_RMP)

/**
  * @brief Disable the remapping of ADC2_ETRGREG (ADC 2 External trigger regular conversion).
  * @note  DISABLE: ADC2 External trigger regular conversion is connected to EINT11
  * @retval None
  */
#define __DAL_AFIO_REMAP_ADC2_ETRGREG_DISABLE() AFIO_REMAP_DISABLE(AFIO_REMAP1_ADC2_ETRGREGC_RMP)

/**
  * @brief Enable the Serial wire JTAG configuration
  * @note  ENABLE: Full SWJ (JTAG-DP + SW-DP): Reset State
  * @retval None
  */
#define __DAL_AFIO_REMAP_SWJ_ENABLE() AFIO_DBGAFR_CONFIG(AFIO_REMAP1_SWJ_CFG_RESET)

/**
  * @brief Enable the Serial wire JTAG configuration
  * @note  NONJTRST: Full SWJ (JTAG-DP + SW-DP) but without NJTRST
  * @retval None
  */
#define __DAL_AFIO_REMAP_SWJ_NONJTRST() AFIO_DBGAFR_CONFIG(AFIO_REMAP1_SWJ_CFG_NOJNTRST)

/**
  * @brief Enable the Serial wire JTAG configuration
  * @note  NOJTAG: JTAG-DP Disabled and SW-DP Enabled
  * @retval None
  */
#define __DAL_AFIO_REMAP_SWJ_NOJTAG() AFIO_DBGAFR_CONFIG(AFIO_REMAP1_SWJ_CFG_JTAGDISABLE)

/**
  * @brief Disable the Serial wire JTAG configuration
  * @note  DISABLE: JTAG-DP Disabled and SW-DP Disabled
  * @retval None
  */
#define __DAL_AFIO_REMAP_SWJ_DISABLE() AFIO_DBGAFR_CONFIG(AFIO_REMAP1_SWJ_CFG_DISABLE)

/**
  * @}
  */
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup GPIOEx_Exported_Macros GPIO Exported Macros
  * @{
  */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup GPIOEx_Exported_Functions GPIO Exported Functions
  * @{
  */
/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup GPIOEx_Private_Constants GPIO Private Constants
  * @{
  */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup GPIOEx_Private_Macros GPIO Private Macros
  * @{
  */
/** @defgroup GPIOEx_Get_Port_Index GPIO Get Port Index
  * @{
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F427xx) || defined(APM32F425xx)
#define GPIO_GET_INDEX(__GPIOx__)    (uint8_t)(((__GPIOx__) == (GPIOA))? 0U :\
                                               ((__GPIOx__) == (GPIOB))? 1U :\
                                               ((__GPIOx__) == (GPIOC))? 2U :\
                                               ((__GPIOx__) == (GPIOD))? 3U :\
                                               ((__GPIOx__) == (GPIOE))? 4U :\
                                               ((__GPIOx__) == (GPIOF))? 5U :\
                                               ((__GPIOx__) == (GPIOG))? 6U :\
                                               ((__GPIOx__) == (GPIOH))? 7U : 8U)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F427xx || APM32F425xx */

#if defined(APM32F411xx)
#define GPIO_GET_INDEX(__GPIOx__)    (uint8_t)(((__GPIOx__) == (GPIOA))? 0U :\
                                               ((__GPIOx__) == (GPIOB))? 1U :\
                                               ((__GPIOx__) == (GPIOC))? 2U :\
                                               ((__GPIOx__) == (GPIOD))? 3U :\
                                               ((__GPIOx__) == (GPIOE))? 4U : 7U)
#endif /* APM32F411xx */

#if defined(APM32F403xx) || defined(APM32F402xx)
#define GPIO_GET_INDEX(__GPIOx__)    (uint8_t)(((__GPIOx__) == (GPIOA))? 0U :\
                                               ((__GPIOx__) == (GPIOB))? 1U :\
                                               ((__GPIOx__) == (GPIOC))? 2U :\
                                               ((__GPIOx__) == (GPIOD))? 3U : 4U)
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

#if defined(APM32F403xx) || defined(APM32F402xx)
/** @defgroup GPIOEx_Eventout_port_selection GPIO Check Eventout Port
  * @{
  */

#define AFIO_EVENTOUT_PORT_A   AFIO_EVCTRL_PORTSEL_PA    /*!< Eventout on port A */
#define AFIO_EVENTOUT_PORT_B   AFIO_EVCTRL_PORTSEL_PB    /*!< Eventout on port B */
#define AFIO_EVENTOUT_PORT_C   AFIO_EVCTRL_PORTSEL_PC    /*!< Eventout on port C */
#define AFIO_EVENTOUT_PORT_D   AFIO_EVCTRL_PORTSEL_PD    /*!< Eventout on port D */

#define IS_AFIO_EVENTOUT_PORT(__PORT__) (((__PORT__) == AFIO_EVENTOUT_PORT_A) || \
                                         ((__PORT__) == AFIO_EVENTOUT_PORT_B) || \
                                         ((__PORT__) == AFIO_EVENTOUT_PORT_C) || \
                                         ((__PORT__) == AFIO_EVENTOUT_PORT_D))

/**
  * @}
  */

/** @defgroup GPIOEx_Eventout_pin_selection GPIO Check Eventout Pin
  * @{
  */

#define AFIO_EVENTOUT_PIN_0   AFIO_EVCTRL_PINSEL_PX0    /*!< Eventout on pin 0 */
#define AFIO_EVENTOUT_PIN_1   AFIO_EVCTRL_PINSEL_PX1    /*!< Eventout on pin 1 */
#define AFIO_EVENTOUT_PIN_2   AFIO_EVCTRL_PINSEL_PX2    /*!< Eventout on pin 2 */
#define AFIO_EVENTOUT_PIN_3   AFIO_EVCTRL_PINSEL_PX3    /*!< Eventout on pin 3 */
#define AFIO_EVENTOUT_PIN_4   AFIO_EVCTRL_PINSEL_PX4    /*!< Eventout on pin 4 */
#define AFIO_EVENTOUT_PIN_5   AFIO_EVCTRL_PINSEL_PX5    /*!< Eventout on pin 5 */
#define AFIO_EVENTOUT_PIN_6   AFIO_EVCTRL_PINSEL_PX6    /*!< Eventout on pin 6 */
#define AFIO_EVENTOUT_PIN_7   AFIO_EVCTRL_PINSEL_PX7    /*!< Eventout on pin 7 */
#define AFIO_EVENTOUT_PIN_8   AFIO_EVCTRL_PINSEL_PX8    /*!< Eventout on pin 8 */
#define AFIO_EVENTOUT_PIN_9   AFIO_EVCTRL_PINSEL_PX9    /*!< Eventout on pin 9 */
#define AFIO_EVENTOUT_PIN_10  AFIO_EVCTRL_PINSEL_PX10   /*!< Eventout on pin 10 */
#define AFIO_EVENTOUT_PIN_11  AFIO_EVCTRL_PINSEL_PX11   /*!< Eventout on pin 11 */
#define AFIO_EVENTOUT_PIN_12  AFIO_EVCTRL_PINSEL_PX12   /*!< Eventout on pin 12 */
#define AFIO_EVENTOUT_PIN_13  AFIO_EVCTRL_PINSEL_PX13   /*!< Eventout on pin 13 */
#define AFIO_EVENTOUT_PIN_14  AFIO_EVCTRL_PINSEL_PX14   /*!< Eventout on pin 14 */
#define AFIO_EVENTOUT_PIN_15  AFIO_EVCTRL_PINSEL_PX15   /*!< Eventout on pin 15 */

