betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_gpio_ex.h
#define IS_AFIO_EVENTOUT_PIN(__PIN__) (((__PIN__) == AFIO_EVENTOUT_PIN_0)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_1)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_2)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_3)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_4)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_5)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_6)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_7)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_8)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_9)  || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_10) || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_11) || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_12) || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_13) || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_14) || \
                                       ((__PIN__) == AFIO_EVENTOUT_PIN_15))

/**
  * @}
  */
#endif /* APM32F403xx || APM32F402xx */

/** @defgroup GPIOEx_IS_Alternat_function_selection GPIO Check Alternate Function
  * @{
  */

/*---------------------------------- APM32F407xx/APM32F417xx------------------*/
#if defined(APM32F407xx) || defined(APM32F417xx)
#define IS_GPIO_AF(AF)   (((AF) == GPIO_AF0_RTC_50Hz)   || ((AF) == GPIO_AF9_TMR14)      || \
                          ((AF) == GPIO_AF0_MCO)        || ((AF) == GPIO_AF0_TAMPER)     || \
                          ((AF) == GPIO_AF0_SWJ)        || ((AF) == GPIO_AF0_TRACE)      || \
                          ((AF) == GPIO_AF1_TMR1)       || ((AF) == GPIO_AF1_TMR2)       || \
                          ((AF) == GPIO_AF2_TMR3)       || ((AF) == GPIO_AF2_TMR4)       || \
                          ((AF) == GPIO_AF2_TMR5)       || ((AF) == GPIO_AF3_TMR8)       || \
                          ((AF) == GPIO_AF4_I2C1)       || ((AF) == GPIO_AF4_I2C2)       || \
                          ((AF) == GPIO_AF4_I2C3)       || ((AF) == GPIO_AF5_SPI1)       || \
                          ((AF) == GPIO_AF5_SPI2)       || ((AF) == GPIO_AF9_TMR13)      || \
                          ((AF) == GPIO_AF6_SPI3)       || ((AF) == GPIO_AF9_TMR12)      || \
                          ((AF) == GPIO_AF7_USART1)     || ((AF) == GPIO_AF7_USART2)     || \
                          ((AF) == GPIO_AF7_USART3)     || ((AF) == GPIO_AF8_UART4)      || \
                          ((AF) == GPIO_AF8_UART5)      || ((AF) == GPIO_AF8_USART6)     || \
                          ((AF) == GPIO_AF9_CAN1)       || ((AF) == GPIO_AF9_CAN2)       || \
                          ((AF) == GPIO_AF10_OTG_FS)    || ((AF) == GPIO_AF10_OTG_HS)    || \
                          ((AF) == GPIO_AF11_ETH)       || ((AF) == GPIO_AF12_OTG_HS_FS) || \
                          ((AF) == GPIO_AF12_SDIO)      || ((AF) == GPIO_AF13_DCI)       || \
                          ((AF) == GPIO_AF12_SMC)       || ((AF) == GPIO_AF12_DMC)       || \
                          ((AF) == GPIO_AF15_EVENTOUT))

#endif /* APM32F407xx || APM32F417xx */
/*----------------------------------------------------------------------------*/

/*---------------------------------- APM32F405xx/APM32F415xx------------------*/
#if defined(APM32F405xx) || defined(APM32F415xx)
#define IS_GPIO_AF(AF)   (((AF) == GPIO_AF0_RTC_50Hz)   || ((AF) == GPIO_AF9_TMR14)      || \
                          ((AF) == GPIO_AF0_MCO)        || ((AF) == GPIO_AF0_TAMPER)     || \
                          ((AF) == GPIO_AF0_SWJ)        || ((AF) == GPIO_AF0_TRACE)      || \
                          ((AF) == GPIO_AF1_TMR1)       || ((AF) == GPIO_AF1_TMR2)       || \
                          ((AF) == GPIO_AF2_TMR3)       || ((AF) == GPIO_AF2_TMR4)       || \
                          ((AF) == GPIO_AF2_TMR5)       || ((AF) == GPIO_AF3_TMR8)       || \
                          ((AF) == GPIO_AF4_I2C1)       || ((AF) == GPIO_AF4_I2C2)       || \
                          ((AF) == GPIO_AF4_I2C3)       || ((AF) == GPIO_AF5_SPI1)       || \
                          ((AF) == GPIO_AF5_SPI2)       || ((AF) == GPIO_AF9_TMR13)      || \
                          ((AF) == GPIO_AF6_SPI3)       || ((AF) == GPIO_AF9_TMR12)      || \
                          ((AF) == GPIO_AF7_USART1)     || ((AF) == GPIO_AF7_USART2)     || \
                          ((AF) == GPIO_AF7_USART3)     || ((AF) == GPIO_AF8_UART4)      || \
                          ((AF) == GPIO_AF8_UART5)      || ((AF) == GPIO_AF8_USART6)     || \
                          ((AF) == GPIO_AF9_CAN1)       || ((AF) == GPIO_AF9_CAN2)       || \
                          ((AF) == GPIO_AF10_OTG_FS)    || ((AF) == GPIO_AF10_OTG_HS)    || \
                          ((AF) == GPIO_AF12_OTG_HS_FS) || ((AF) == GPIO_AF12_SDIO)      || \
                          ((AF) == GPIO_AF12_SMC)       || ((AF) == GPIO_AF15_EVENTOUT))

#endif /* APM32F405xx || APM32F415xx */

/*----------------------------------------------------------------------------*/

/*---------------------------------- APM32F465xx------------------*/
#if defined(APM32F465xx)
#define IS_GPIO_AF(AF)   (((AF) == GPIO_AF0_RTC_50Hz)   || ((AF) == GPIO_AF9_TMR14)      || \
                          ((AF) == GPIO_AF0_MCO)        || ((AF) == GPIO_AF0_TAMPER)     || \
                          ((AF) == GPIO_AF0_SWJ)        || ((AF) == GPIO_AF0_TRACE)      || \
                          ((AF) == GPIO_AF1_TMR1)       || ((AF) == GPIO_AF1_TMR2)       || \
                          ((AF) == GPIO_AF2_TMR3)       || ((AF) == GPIO_AF2_TMR4)       || \
                          ((AF) == GPIO_AF2_TMR5)       || ((AF) == GPIO_AF3_TMR8)       || \
                          ((AF) == GPIO_AF4_I2C1)       || ((AF) == GPIO_AF4_I2C2)       || \
                          ((AF) == GPIO_AF4_I2C3)       || ((AF) == GPIO_AF5_SPI1)       || \
                          ((AF) == GPIO_AF5_SPI2)       || ((AF) == GPIO_AF9_TMR13)      || \
                          ((AF) == GPIO_AF6_SPI3)       || ((AF) == GPIO_AF9_TMR12)      || \
                          ((AF) == GPIO_AF7_USART1)     || ((AF) == GPIO_AF7_USART2)     || \
                          ((AF) == GPIO_AF7_USART3)     || ((AF) == GPIO_AF8_UART4)      || \
                          ((AF) == GPIO_AF8_UART5)      || ((AF) == GPIO_AF8_USART6)     || \
                          ((AF) == GPIO_AF9_CAN1)       || ((AF) == GPIO_AF9_CAN2)       || \
                          ((AF) == GPIO_AF10_OTG_FS)    || ((AF) == GPIO_AF10_OTG_HS)    || \
                          ((AF) == GPIO_AF12_OTG_HS_FS) || ((AF) == GPIO_AF12_SDIO)      || \
                          ((AF) == GPIO_AF12_SMC)       || ((AF) == GPIO_AF15_EVENTOUT))

#endif /* APM32F465xx */

