betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_gpio_ex.h
/*----------------------------------------------------------------------------*/

/*---------------------------------------- APM32F411xx------------------------*/
#if defined(APM32F411xx)
#define IS_GPIO_AF(AF)   (((AF) == GPIO_AF0_RTC_50Hz)   || ((AF) == GPIO_AF11_SMC)       || \
                          ((AF) == GPIO_AF0_MCO)        || ((AF) == GPIO_AF0_TAMPER)     || \
                          ((AF) == GPIO_AF0_SWJ)        || ((AF) == GPIO_AF0_TRACE)      || \
                          ((AF) == GPIO_AF1_TMR1)       || ((AF) == GPIO_AF1_TMR2)       || \
                          ((AF) == GPIO_AF2_TMR3)       || ((AF) == GPIO_AF2_TMR4)       || \
                          ((AF) == GPIO_AF2_TMR5)       || ((AF) == GPIO_AF3_TMR8)       || \
                          ((AF) == GPIO_AF3_TMR9)       || ((AF) == GPIO_AF3_TMR10)      || \
                          ((AF) == GPIO_AF3_TMR11)      || ((AF) == GPIO_AF4_I2C1)       || \
                          ((AF) == GPIO_AF4_I2C2)       || ((AF) == GPIO_AF4_I2C3)       || \
                          ((AF) == GPIO_AF5_SPI1)       || ((AF) == GPIO_AF5_SPI2)       || \
                          ((AF) == GPIO_AF5_SPI3)       || ((AF) == GPIO_AF5_SPI4)       || \
                          ((AF) == GPIO_AF5_I2S3ext)    || ((AF) == GPIO_AF6_SPI2)       || \
                          ((AF) == GPIO_AF6_SPI3)       || ((AF) == GPIO_AF6_SPI4)       || \
                          ((AF) == GPIO_AF6_SPI5)       || ((AF) == GPIO_AF6_I2S2ext)    || \
                          ((AF) == GPIO_AF7_SPI3)       || ((AF) == GPIO_AF7_USART1)     || \
                          ((AF) == GPIO_AF7_USART2)     || ((AF) == GPIO_AF7_USART3)     || \
                          ((AF) == GPIO_AF7_I2S3ext)    || ((AF) == GPIO_AF8_USART3)     || \
                          ((AF) == GPIO_AF8_UART4)      || ((AF) == GPIO_AF8_UART5)      || \
                          ((AF) == GPIO_AF8_USART6)     || ((AF) == GPIO_AF8_CAN1)       || \
                          ((AF) == GPIO_AF9_CAN2)       || ((AF) == GPIO_AF9_TMR12)      || \
                          ((AF) == GPIO_AF9_TMR13)      || ((AF) == GPIO_AF9_TMR14)      || \
                          ((AF) == GPIO_AF9_I2C2)       || ((AF) == GPIO_AF9_I2C3)       || \
                          ((AF) == GPIO_AF9_QSPI)       || ((AF) == GPIO_AF10_OTG_FS)    || \
                          ((AF) == GPIO_AF10_QSPI)      || ((AF) == GPIO_AF10_SMC)       || \
                          ((AF) == GPIO_AF11_SDIO)      || ((AF) == GPIO_AF15_EVENTOUT))

#endif /* APM32F411xx */
/*----------------------------------------------------------------------------*/

/*---------------------------------- APM32F423xx/APM32F425xx/APM32F427xx------------------*/
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define IS_GPIO_AF(AF)   (((AF) == GPIO_AF0_RTC_50Hz)   || ((AF) == GPIO_AF9_TMR14)      || \
                          ((AF) == GPIO_AF0_MCO)        || ((AF) == GPIO_AF0_TAMPER)     || \
                          ((AF) == GPIO_AF0_SWJ)        || ((AF) == GPIO_AF0_TRACE)      || \
                          ((AF) == GPIO_AF1_TMR1)       || ((AF) == GPIO_AF1_TMR2)       || \
                          ((AF) == GPIO_AF2_TMR3)       || ((AF) == GPIO_AF2_TMR4)       || \
                          ((AF) == GPIO_AF2_TMR5)       || ((AF) == GPIO_AF3_TMR8)       || \
                          ((AF) == GPIO_AF4_I2C1)       || ((AF) == GPIO_AF4_I2C2)       || \
                          ((AF) == GPIO_AF4_I2C3)       || ((AF) == GPIO_AF5_SPI1)       || \
                          ((AF) == GPIO_AF5_SPI2)       || ((AF) == GPIO_AF9_TMR13)      || \
                          ((AF) == GPIO_AF6_SPI3)       || ((AF) == GPIO_AF9_TMR12)      || \
                          ((AF) == GPIO_AF7_USART1)     || ((AF) == GPIO_AF7_USART2)     || \
                          ((AF) == GPIO_AF7_USART3)     || ((AF) == GPIO_AF8_UART4)      || \
                          ((AF) == GPIO_AF8_UART5)      || ((AF) == GPIO_AF8_USART6)     || \
                          ((AF) == GPIO_AF9_CAN1)       || ((AF) == GPIO_AF9_CAN2)       || \
                          ((AF) == GPIO_AF9_QSPI)       || ((AF) == GPIO_AF10_OTG_FS)    || \
                          ((AF) == GPIO_AF10_QSPI)      || ((AF) == GPIO_AF11_ETH)       || \
                          ((AF) == GPIO_AF12_OTG_FS2)   || ((AF) == GPIO_AF12_SDIO)      || \
                          ((AF) == GPIO_AF12_SMC)       || ((AF) == GPIO_AF12_DMC)       || \
                          ((AF) == GPIO_AF15_EVENTOUT))

#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
/*----------------------------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup GPIOEx_Private_Functions GPIO Private Functions
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define AFIO_REMAP_ENABLE(REMAP_PIN)       do{ uint32_t tmpreg = AFIO->REMAP1; \
                                               tmpreg |= AFIO_REMAP1_SWJ_CFG;  \
                                               tmpreg |= REMAP_PIN;            \
                                               AFIO->REMAP1 = tmpreg;          \
                                               }while(0u)

#define AFIO_REMAP_DISABLE(REMAP_PIN)      do{ uint32_t tmpreg = AFIO->REMAP1;  \
                                               tmpreg |= AFIO_REMAP1_SWJ_CFG;   \
                                               tmpreg &= ~REMAP_PIN;            \
                                               AFIO->REMAP1 = tmpreg;           \
                                               }while(0u)

#define AFIO_REMAP_PARTIAL(REMAP_PIN, REMAP_PIN_MASK) do{ uint32_t tmpreg = AFIO->REMAP1; \
                                                          tmpreg &= ~REMAP_PIN_MASK;      \
                                                          tmpreg |= AFIO_REMAP1_SWJ_CFG;  \
                                                          tmpreg |= REMAP_PIN;            \
                                                          AFIO->REMAP1 = tmpreg;          \
                                                          }while(0u)

#define AFIO_DBGAFR_CONFIG(DBGAFR_SWJCFG)  do{ uint32_t tmpreg = AFIO->REMAP1;    \
                                               tmpreg &= ~AFIO_REMAP1_SWJ_CFG;    \
                                               tmpreg |= DBGAFR_SWJCFG;           \
                                               AFIO->REMAP1 = tmpreg;             \
                                               }while(0u)
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup GPIOEx_Exported_Functions
  * @{
  */
#if defined(APM32F403xx) || defined(APM32F402xx)
/** @addtogroup GPIOEx_Exported_Functions_Group1
  * @{
  */
void DAL_GPIOEx_ConfigEventout(uint32_t GPIO_PortSource, uint32_t GPIO_PinSource);
void DAL_GPIOEx_EnableEventout(void);
void DAL_GPIOEx_DisableEventout(void);
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DAL_GPIO_EX_H */

